DataProcessors/ВводНутриентовДляПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>ВводНутриентовДляПродуктов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ХимическийСоставПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>ХимическийСоставПродуктов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПродуктыПитания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Нутриент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нутриенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Нутриенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Нутриенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНутриентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Растворимость</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Растворимость</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БиологическиеФункции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Нарушения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Нарушение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыНарушенийДисбалансаВитаминов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Симптом</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СимтомыНарушений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ВводНутриентовДляПродуктов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ПродуктПитания", ПродуктПитания) ИЛИ НЕ ЗначениеЗаполнено(ПродуктПитания) ИЛИ ПродуктПитания.ЭтоГруппа Тогда
		Отказ = Истина;	
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		СформироватьДеревоНутриентов();	
		Заголовок = ПродуктПитания;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьХимическийСостав(Команда)
	СохранитьХимическийСоставНаСервере();
	Закрыть();
КонецПроцедуры  

&НаСервере
Процедура СформироватьДеревоНутриентов()   	
			
    ДанныеЗаполнения = ПолучитьДанныеДереваНутриентов();
	
	ЗаполнитьДеревоНутриентов(ДеревоНутриенты.ПолучитьЭлементы(), ДанныеЗаполнения.ТаблицаГрупп, ДанныеЗаполнения.ВыборкаЭлементов, 
									Новый Структура("Родитель", Справочники.Нутриенты.ПустаяСсылка()));
									
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДереваНутриентов()
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Нутриенты.Ссылка КАК Нутриент,
		|	Нутриенты.Родитель
		|ИЗ
		|	Справочник.Нутриенты КАК Нутриенты
		|ГДЕ
		|	Нутриенты.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Нутриенты.Ссылка КАК Нутриент,
		|	ЕСТЬNULL(ХимическийСоставПродуктов.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(ХимическийСоставПродуктов.Количество, 0) КАК СтароеКоличество,
		|	Нутриенты.Тип КАК Тип,
		|	Нутриенты.Родитель КАК Родитель,
		|	Нутриенты.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.Нутриенты КАК Нутриенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ХимическийСоставПродуктов.Нутриент КАК Нутриент,
		|			ХимическийСоставПродуктов.Количество КАК Количество
		|		ИЗ
		|			РегистрСведений.ХимическийСоставПродуктов КАК ХимическийСоставПродуктов
		|		ГДЕ
		|			ХимическийСоставПродуктов.Продукт = &Продукт) КАК ХимическийСоставПродуктов
		|		ПО Нутриенты.Ссылка = ХимическийСоставПродуктов.Нутриент
		|ГДЕ
		|	НЕ Нутриенты.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Продукт", ПродуктПитания);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат.Вставить("ТаблицаГрупп", РезультатЗапроса[0].Выгрузить());
	Результат.Вставить("ВыборкаЭлементов", РезультатЗапроса[1].Выбрать());
	
	Возврат Результат;
	
КонецФункции  

&НаСервере 								
Процедура ЗаполнитьДеревоНутриентов(СтрокаДерева, ТаблицаГрупп, ВыборкаЭлементов, СтруктураПоиска)  	
		
	МассивСтрок = ТаблицаГрупп.НайтиСтроки(СтруктураПоиска); 
	Для каждого СтрокаТаблицы Из МассивСтрок Цикл
		
		НоваяГруппаДерева 					= СтрокаДерева.Добавить();
		НоваяГруппаДерева.Картинка 			= БиблиотекаКартинок.ЭлектронноеПисьмо;
		НоваяГруппаДерева.Нутриент 			= СтрокаТаблицы.Нутриент;
		НоваяГруппаДерева.ЭтоГруппа			= Истина;
		
		ЗаполнитьДеревоНутриентов(НоваяГруппаДерева.ПолучитьЭлементы(), ТаблицаГрупп, ВыборкаЭлементов,
										Новый Структура("Родитель", СтрокаТаблицы.Нутриент));
		
	КонецЦикла; 
							
	ВыборкаЭлементов.Сбросить();						
	
	Пока ВыборкаЭлементов.НайтиСледующий(СтруктураПоиска) Цикл
		
		НоваяСтрокаДерева 			= СтрокаДерева.Добавить();	
		НоваяСтрокаДерева.Картинка 	= БиблиотекаКартинок.Реквизит;
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, ВыборкаЭлементов);		 		
		
	КонецЦикла;
	
КонецПроцедуры								

&НаСервере
Процедура СохранитьХимическийСоставНаСервере()
	
	Набор = РегистрыСведений.ХимическийСоставПродуктов.СоздатьНаборЗаписей();
	Набор.Отбор.Продукт.Установить(ПродуктПитания);	
	
	ОбходДереваНутриентов(Набор, ДеревоНутриенты.ПолучитьЭлементы());	
	
	Если Набор.Количество() > 0 Тогда
		Набор.Записать(Истина);	
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ОбходДереваНутриентов(Набор, СтрокиДерева)	
	 
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если СтрокаДерева.ЭтоГруппа Тогда
			ОбходДереваНутриентов(Набор, СтрокаДерева.ПолучитьЭлементы());	
		ИначеЕсли СтрокаДерева.Количество <> СтрокаДерева.СтароеКоличество Тогда 
			Запись 				= Набор.Добавить();
			Запись.Продукт  	= ПродуктПитания;
			Запись.Нутриент 	= СтрокаДерева.Нутриент;
			Запись.Количество 	= СтрокаДерева.Количество;
		КонецЕсли;
		
	КонецЦикла;  	
	
КонецПроцедуры
